docs/org/server.org
#+TITLE: Server Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: server
#+HUGO_TYPE: docs
#+HUGO_PAIRED_SHORTCODES: tip 
** Reasoner
   :PROPERTIES:
   :EXPORT_FILE_NAME: reasoner
   :EXPORT_HUGO_WEIGHT: 220
   :END:
*** Installation

    The [[https://github.com/workflowfm/workflowfm-reasoner][WorkflowFM Reasoner]] can be installed following the [[http://docs.workflowfm.com/workflowfm-reasoner/docs/install/][instructions in its documentation]].

    The involved ~hol-light~ repository can already be found as a submodule under ~server/hol-light~.

    Using [[http://docs.workflowfm.com/workflowfm-reasoner/docs/install/hol-light/#checkpointing][checkpointing]], if possible, can help build a server that runs /instantly/.

*** Launch script
    :PROPERTIES:
    :CUSTOM_ID: script
    :END:

    Once the reasoner is installed and working, we need to build a script that runs the reasoner and pipes the input/output to the server.

    The ~scripts/~ directory contains bash scripts that can help achieve this. Both scripts assume that the reasoner is installed in a ~hol-light/~ directory within the server installation. If that is not the case, this can be adjusted using a symbolic link:

    #+BEGIN_SRC sh
      ln -s full/path/to/reasoner hol-light
    #+END_SRC

    - If checkpointing (dmtcp) was used, the reasoner can run using ~./scripts/launch_prover_local.sh~.
    - If checkpointing is *not* available, you can use ~./scripts/launch_prover_docker.sh~ which is what the Docker build uses to load HOL Light and the reasoner from scratch.
    - You can also run the reasoner on a remote machine using an ssh tunnel. This assumes an installation of the server /and/ the reasoner on that machine, the use of checkpointing, and password-less ssh access to the remote machine. In that case you can use ~./scrips/setup_remote_prover.sh~ to create a remote launch script (~./scripts/launch_prover.sh~), using the url of the remote machine and the absolute path to the installation of the reasoner:
      #+BEGIN_SRC sh
        ./scripts/setup_remote_prover.sh someuser@host.of.reasoner.com /home/someuser/workflowfm-server/scripts/launch_prover_local.sh
      #+END_SRC

      Make sure you run the corresponding script and verify it does load the reasoner correctly and without errors. The reasoner should run through the script and allow you to issue OCaml toplevel commands. It should react (and exit) if you provide the following command:
      #+BEGIN_SRC ocaml
        exit(0);;
      #+END_SRC

